InformationRegisters/ДанныеАвторизацииДомКлик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ДанныеАвторизацииДомКлик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>access_token</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>token_type</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>expires_in</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>refresh_token</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>id_token</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГраницаДоступности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>client_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>client_secret</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ПараметрыПодключенияAPIИпотечныхБанков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>ПараметрыПодключенияAPIИпотечныхБанков</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>username</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>password</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродуктивныйСтенд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТестовыйСтенд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродуктивныйСтенд_Token</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТестовыйСтенд_Token</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПрокси</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПротоколПрокси</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиСервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортПрокси</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователяПрокси</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПрокси</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьАутентификациюОСПрокси</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДляРассылки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоОтправкаПисем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормализацияАдресаDaData</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиПравДоступаПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаПользователя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектДоступа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>username</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>password</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьПрокси</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПротоколПрокси</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроксиСервер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПортПрокси</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПользователяПрокси</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПарольПрокси</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьАутентификациюОСПрокси</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДляРассылки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПочтовыеАдресаПолучателейЗаявок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПочтаПолучателяЗаявок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/УправлениеИпотечнымиЗаявкамиДомКлик/Ext/Module.bsl
#Область МетодыAPI                         

Функция ПолучитьСекреты(ПараметрыAPI) Экспорт
	
	client_id = "";	
	client_secret = "";
	
	УстановитьПривилегированныйРежим(Истина);
    Данные = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ПараметрыAPI, "Секреты");
	Если ТипЗнч(Данные) = Тип("Структура") И Данные.Свойство("client_id") И Данные.Свойство("client_secret") Тогда
		client_id = Данные.client_id;
		client_secret = Данные.client_secret;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат Новый Структура("client_id, client_secret", client_id, client_secret);
	
КонецФункции

Процедура ЗаписатьСекреты(ПараметрыAPI, client_id, client_secret) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Данные = Новый Структура("client_id, client_secret", client_id, client_secret);
    ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ПараметрыAPI, Данные, "Секреты");
    УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ВыполнитьАвторизацию(ПараметрыAPI, Ошибки = "", Тест = Ложь) Экспорт

	ТокенДоступа = "";
	
	Секреты = ПолучитьСекреты(ПараметрыAPI);
	ПараметрыПодключения = ПолучитьПараметрыПодключения(ПараметрыAPI, , , Истина);

	Boundary = "----" + СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", ""); 
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Authorization", "Basic " + ПолучитьBase64ЗаголовокАвторизации(Секреты.client_id, Секреты.client_secret));
	ЗаголовокHTTP.Вставить("Content-Type", "multipart/form-data; boundary=" + Boundary);
	
	HTTPМетод = "POST";
	Сервер = ?(Тест, ПараметрыПодключения.ТестовыйСтенд_Token, ПараметрыПодключения.ПродуктивныйСтенд_Token);
	Прокси = ПараметрыПодключения.Прокси;
	АдресРесурса = "/token";	
	ТелоЗапроса = "--" + Boundary + "
	|Content-Disposition: form-data; name=""grant_type""
	|
	|client_credentials
	|--" + Boundary + "--";
	
 	ПараметрыЗапроса = ПолучитьПараметрыЗапроса(HTTPМетод, Сервер, АдресРесурса, ТелоЗапроса, Прокси);
	
	ОтветСервера = ВыполнитьHTTPЗапрос(ПараметрыЗапроса, ЗаголовокHTTP);	
	
	Если НЕ ОтветСервера = Неопределено Тогда
		Если ОтветСервера.Свойство("error") Тогда
			Ошибки = ОтветСервера.error;	
		Иначе	
			РегМен = РегистрыСведений.ДанныеАвторизацииДомКлик.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(РегМен, ОтветСервера);			
			РегМен.client_id = Секреты.client_id;
			РегМен.client_secret = Секреты.client_secret;
			РегМен.ГраницаДоступности = ТекущаяДата() + РегМен.expires_in - ПараметрыЗапроса.Таймаут;
			РегМен.Записать();
			
			ТокенДоступа = РегМен.access_token;
		КонецЕсли;
	Иначе
		Ошибки = Ошибки + Символы.ПС + "Не удалось получить результат запроса";
	КонецЕсли;
	
	Возврат ТокенДоступа;
	
КонецФункции

Функция БанкОфисы(ПараметрыAPI, Ошибки = "", Тест = Ложь) Экспорт

	Офисы = Новый Массив;
	ПараметрыПодключения = ПолучитьПараметрыПодключения(ПараметрыAPI, , , Истина);
	
	Ошибки = "";
	Секреты = ПолучитьСекреты(ПараметрыAPI);	
	access_token = ПолучитьТокенДоступа(Секреты.client_id, Секреты.client_secret);
	access_token = ?(ЗначениеЗаполнено(access_token), access_token, ВыполнитьАвторизацию(ПараметрыAPI, Ошибки, Тест));
	Если НЕ ЗначениеЗаполнено(access_token) Тогда
		Ошибки = Ошибки + Символы.ПС + "Не удалось выполнить авторизацию.";
		Возврат Офисы;
	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("'Accept", "application/json");
	ЗаголовокHTTP.Вставить("Authorization", "Bearer " + access_token);
	
	HTTPМетод = "GET";
	Сервер = ?(Тест, ПараметрыПодключения.ТестовыйСтенд, ПараметрыПодключения.ПродуктивныйСтенд);
	Прокси = ПараметрыПодключения.Прокси;
	АдресРесурса = "/application/api/v2/bankoffices";
	ТелоЗапроса = "";
	
 	ПараметрыЗапроса = ПолучитьПараметрыЗапроса(HTTPМетод, Сервер, АдресРесурса, ТелоЗапроса, Прокси);
	
	ОтветСервера = ВыполнитьHTTPЗапрос(ПараметрыЗапроса, ЗаголовокHTTP);	
	Если НЕ ОтветСервера = Неопределено Тогда
		Если ТипЗнч(ОтветСервера) = Тип("Структура") И ОтветСервера.Свойство("error") Тогда
			Ошибки = ОтветСервера.error;	
		Иначе	
			Офисы = ОтветСервера;	
		КонецЕсли;
	КонецЕсли;
	
	Возврат Офисы;
	
КонецФункции	

Функция Словарь(ПараметрыAPI, Ошибки = "", Тест = Ложь) Экспорт

	Данные = Новый Массив;
	ПараметрыПодключения = ПолучитьПараметрыПодключения(ПараметрыAPI, , , Истина);
	
	Ошибки = "";
	Секреты = ПолучитьСекреты(ПараметрыAPI);	
	access_token = ПолучитьТокенДоступа(Секреты.client_id, Секреты.client_secret);
	access_token = ?(ЗначениеЗаполнено(access_token), access_token, ВыполнитьАвторизацию(ПараметрыAPI, Ошибки, Тест));
	Если НЕ ЗначениеЗаполнено(access_token) Тогда
		Ошибки = Ошибки + Символы.ПС + "Не удалось выполнить авторизацию.";
		Возврат Данные;
	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("'Accept", "application/json");
	ЗаголовокHTTP.Вставить("Authorization", "Bearer " + access_token);
	
	HTTPМетод = "GET";
	Сервер = ?(Тест, ПараметрыПодключения.ТестовыйСтенд, ПараметрыПодключения.ПродуктивныйСтенд);
	Прокси = ПараметрыПодключения.Прокси;
	АдресРесурса = "/application/api/v2/dictionaries";
	ТелоЗапроса = "";
	
 	ПараметрыЗапроса = ПолучитьПараметрыЗапроса(HTTPМетод, Сервер, АдресРесурса, ТелоЗапроса, Прокси);
	
	ОтветСервера = ВыполнитьHTTPЗапрос(ПараметрыЗапроса, ЗаголовокHTTP);	
	Если НЕ ОтветСервера = Неопределено Тогда
		Если ТипЗнч(ОтветСервера) = Тип("Структура") И ОтветСервера.Свойство("error") Тогда
			Ошибки = ОтветСервера.error;	
		Иначе	
			Данные = ОтветСервера;	
		КонецЕсли;
	Иначе
		Ошибки = Ошибки + Символы.ПС + "Не удалось получить результат запроса";		
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти

#Область HTTPЗапрос

Функция ВыполнитьHTTPЗапрос(ПараметрыЗапроса, Заголовки)

	HTTPЗапрос = ПодготовитьHTTPЗапрос(ПараметрыЗапроса.АдресРесурса, Заголовки, ПараметрыЗапроса.ТелоЗапроса, ПараметрыЗапроса.HTTPМетод); 
	HTTPОтвет = Неопределено;                                                                                                          
		
	Попытка		
		HTTPСоединение = Новый HTTPСоединение(ПараметрыЗапроса.Сервер, ПараметрыЗапроса.Порт, , , ПараметрыЗапроса.Прокси, ПараметрыЗапроса.Таймаут, ПараметрыЗапроса.ЗащищенноеСоединение);		
		Если ПараметрыЗапроса.HTTPМетод = "POST" Тогда
			HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		ИначеЕсли ПараметрыЗапроса.HTTPМетод = "GET" Тогда
			HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
		Иначе
			HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод(ПараметрыЗапроса.HTTPМетод, HTTPЗапрос);
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'HTTP запрос ДомКлик'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
		
	Если НЕ HTTPОтвет = Неопределено Тогда		
		ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();		
		
		ОтветСервера = Неопределено;
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстОтвета);
			ОтветСервера = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'HTTP ответ ДомКлик'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , , "Ошибка:" + ТекстОтвета + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
			
		Возврат ОтветСервера;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПодготовитьHTTPЗапрос(АдресРесурса, Заголовки, ПараметрыЗапроса, HTTPМетод = "POST", Boundary = "") Экспорт
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
	
	Если ТипЗнч(ПараметрыЗапроса) = Тип("Строка") Тогда		
		HTTPЗапрос.УстановитьТелоИзСтроки(ПараметрыЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);	
	Иначе		
		Если HTTPМетод = "POST" Тогда			
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			ЗаписатьJSON(ЗаписьJSON, ПараметрыЗапроса);			
			СтрокаПараметров = ЗаписьJSON.Закрыть();
			HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаПараметров, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		ИначеЕсли HTTPМетод = "GET" Тогда
			СписокПараметров = Новый Массив;
			Для Каждого Параметр Из ПараметрыЗапроса Цикл
				СписокПараметров.Добавить(Параметр.Ключ + "=" + КодироватьСтроку(Параметр.Значение, СпособКодированияСтроки.КодировкаURL));
			КонецЦикла;
			СтрокаПараметров = СтрСоединить(СписокПараметров, "&");			
			АдресРесурса = АдресРесурса + ?(НЕ ПустаяСтрока(СтрокаПараметров), "?" + СтрокаПараметров, "");
			HTTPЗапрос.АдресРесурса = АдресРесурса;
		Иначе
			СтрокаПараметров = "";
		КонецЕсли;
	КонецЕсли;
	
	Возврат HTTPЗапрос;

КонецФункции

Функция ПолучитьПрокси()
	
	Прокси = Новый ИнтернетПрокси;
	Прокси.Установить("HTTP", "Mosrfrfw01.absgroup.ru", 8080); //mosrrasfw01.absgroup.ru - 403
	                             
	Возврат Прокси; //ПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси("https")
	
КонецФункции

Функция ПолучитьПараметрыЗапроса(HTTPМетод, Сервер, АдресРесурса, ТелоЗапроса, Прокси)
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows(), Новый СертификатыУдостоверяющихЦентровWindows());
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Сервер", Сервер);
	ПараметрыЗапроса.Вставить("Порт", Неопределено);
	ПараметрыЗапроса.Вставить("Пользователь", Неопределено);
	ПараметрыЗапроса.Вставить("Пароль", Неопределено);
	ПараметрыЗапроса.Вставить("Прокси", Прокси); //ПолучитьПрокси() 
	ПараметрыЗапроса.Вставить("Таймаут", 60);
	ПараметрыЗапроса.Вставить("ЗащищенноеСоединение", ssl); 
	
	ПараметрыЗапроса.Вставить("HTTPМетод", HTTPМетод);	
	ПараметрыЗапроса.Вставить("АдресРесурса", АдресРесурса);
	ПараметрыЗапроса.Вставить("ТелоЗапроса", ТелоЗапроса);
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

Функция ПолучитьBase64ЗаголовокАвторизации(ID, Secret)

    КодировкаФайла = КодировкаТекста.UTF8;
    ВременныйФайл = ПолучитьИмяВременногоФайла();
	
	Запись = Новый ЗаписьТекста(ВременныйФайл, КодировкаФайла);
    Запись.Записать(ID + ":" + Secret);
    Запись.Закрыть();

    ДвДанные = Новый ДвоичныеДанные(ВременныйФайл);
    Результат = Base64Строка(ДвДанные);
	
	Результат = СтрЗаменить(Результат, Символы.ВК, "");
	Результат = СтрЗаменить(Результат, Символы.ПС, "");	
	
    УдалитьФайлы(ВременныйФайл);

    Результат = Сред(Результат, 5);

    Возврат Результат;

КонецФункции

#КонецОбласти

#Область Вспоимогательное

Функция ПолучитьПараметрыПодключения(ПараметрыAPI, Ответственный = Неопределено, ВыводитьПараметры = Ложь, ДляАвторизации = Ложь) Экспорт
	
	Запрос = Новый Запрос;	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПараметрыПодключенияAPI.Ссылка.username КАК username_common,
	|	ПараметрыПодключенияAPI.Ссылка.password КАК password_common,
	|	ПараметрыПодключенияAPI.Ссылка.АдресДляРассылки КАК АдресДляРассылки_common,
	|	ПараметрыПодключенияAPI.Ссылка.ПродуктивныйСтенд КАК ПродуктивныйСтенд,
	|	ПараметрыПодключенияAPI.Ссылка.ТестовыйСтенд КАК ТестовыйСтенд,
	|	ПараметрыПодключенияAPI.Ссылка.ПродуктивныйСтенд_Token КАК ПродуктивныйСтенд_Token,
	|	ПараметрыПодключенияAPI.Ссылка.ТестовыйСтенд_Token КАК ТестовыйСтенд_Token,
	|	ПараметрыПодключенияAPI.ИспользоватьПрокси КАК ИспользоватьПрокси,
	|	ПараметрыПодключенияAPI.ПротоколПрокси КАК ПротоколПрокси,
	|	ПараметрыПодключенияAPI.ПроксиСервер КАК ПроксиСервер,
	|	ПараметрыПодключенияAPI.ПортПрокси КАК ПортПрокси,
	|	ПараметрыПодключенияAPI.ИмяПользователяПрокси КАК ИмяПользователяПрокси,
	|	ПараметрыПодключенияAPI.ПарольПрокси КАК ПарольПрокси,
	|	ПараметрыПодключенияAPI.ИспользоватьАутентификациюОСПрокси КАК ИспользоватьАутентификациюОСПрокси,
	|	ПараметрыПодключенияAPI.ГруппаПользователя КАК ГруппаПользователя,
	|	ПараметрыПодключенияAPI.username КАК username,
	|	ПараметрыПодключенияAPI.password КАК password,
	|	ПараметрыПодключенияAPI.АдресДляРассылки КАК АдресДляРассылки,
	|	ИСТИНА КАК Использование
	|ИЗ
	|	Справочник.ПараметрыПодключенияAPIИпотечныхБанков.НастройкиПравДоступаПользователей КАК ПараметрыПодключенияAPI
	|ГДЕ
	|	ПараметрыПодключенияAPI.Ссылка = &ПараметрыAPI
	|	И ПараметрыПодключенияAPI.ГруппаПользователя В(&ГруппыПользователя)
	|	И ПараметрыПодключенияAPI.ОбъектДоступа = &ОбъектДоступа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПараметрыПодключенияAPIИпотечныхБанков.username,
	|	ПараметрыПодключенияAPIИпотечныхБанков.password,
	|	ПараметрыПодключенияAPIИпотечныхБанков.АдресДляРассылки,
	|	ПараметрыПодключенияAPIИпотечныхБанков.ПродуктивныйСтенд,
	|	ПараметрыПодключенияAPIИпотечныхБанков.ТестовыйСтенд,
	|	ПараметрыПодключенияAPIИпотечныхБанков.ПродуктивныйСтенд_Token,
	|	ПараметрыПодключенияAPIИпотечныхБанков.ТестовыйСтенд_Token,
	|	ПараметрыПодключенияAPIИпотечныхБанков.ИспользоватьПрокси,
	|	ПараметрыПодключенияAPIИпотечныхБанков.ПротоколПрокси,
	|	ПараметрыПодключенияAPIИпотечныхБанков.ПроксиСервер,
	|	ПараметрыПодключенияAPIИпотечныхБанков.ПортПрокси,
	|	ПараметрыПодключенияAPIИпотечныхБанков.ИмяПользователяПрокси,
	|	ПараметрыПодключенияAPIИпотечныхБанков.ПарольПрокси,
	|	ПараметрыПодключенияAPIИпотечныхБанков.ИспользоватьАутентификациюОСПрокси,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ПараметрыПодключенияAPIИпотечныхБанков.АдресДляРассылки,
	|	ЛОЖЬ
	|ИЗ
	|	Справочник.ПараметрыПодключенияAPIИпотечныхБанков КАК ПараметрыПодключенияAPIИпотечныхБанков
	|ГДЕ
	|	ПараметрыПодключенияAPIИпотечныхБанков.Ссылка = &ПараметрыAPI";	
		
	ГруппыПользователя = ПолучитьГруппыПользователя(Ответственный);
	Если ГруппыПользователя = Неопределено ИЛИ НЕ ГруппыПользователя.Количество() Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПараметрыПодключенияAPI.ГруппаПользователя В(&ГруппыПользователя)", "И ЛОЖЬ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПараметрыПодключенияAPI.ОбъектДоступа = &ОбъектДоступа", "");
	Иначе
		Если ГруппыПользователя.Количество() > 1 Тогда
			ОбъектДоступа = ПолучитьОсновнойОбъектПользователя(Ответственный);
			Если ЗначениеЗаполнено(ОбъектДоступа) Тогда
				Запрос.УстановитьПараметр("ОбъектДоступа", ОбъектДоступа);
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПараметрыПодключенияAPI.ГруппаПользователя В(&ГруппыПользователя)", "");
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПараметрыПодключенияAPI.ОбъектДоступа = &ОбъектДоступа", "");
			КонецЕсли;
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПараметрыПодключенияAPI.ОбъектДоступа = &ОбъектДоступа", "");	
		КонецЕсли;
		Запрос.УстановитьПараметр("ГруппыПользователя", ГруппыПользователя);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПараметрыAPI", ПараметрыAPI);	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		СтруктураПараметры = Новый Структура("username, password, username_common, password_common, АдресДляРассылки_common, ПродуктивныйСтенд, ТестовыйСтенд, ПродуктивныйСтенд_Token, ТестовыйСтенд_Token, Прокси, ГруппаПользователя, ПроксиСервер, АдресДляРассылки");
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтруктураПараметры, Выборка);
			Если Выборка.ИспользоватьПрокси Тогда
				Прокси = Новый ИнтернетПрокси;
				Прокси.НеИспользоватьПроксиДляЛокальныхАдресов = Истина;
				Прокси.Установить(Выборка.ПротоколПрокси, Выборка.ПроксиСервер, Выборка.ПортПрокси, Выборка.ИмяПользователяПрокси, Выборка.ПарольПрокси, Выборка.ИспользоватьАутентификациюОСПрокси); //Прокси.Установить("https", "mosrfrfw01.absgroup.ru", "8080", , , Истина); 
				СтруктураПараметры.Прокси = Прокси;
			КонецЕсли;
			Если НЕ Выборка.Использование ИЛИ ДляАвторизации Тогда
				СтруктураПараметры.username = Выборка.username_common;
				СтруктураПараметры.password = Выборка.password_common;
			КонецЕсли;				
		КонецЕсли;
		
		Если ВыводитьПараметры Тогда
			Для каждого Элемент Из СтруктураПараметры Цикл
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Элемент.Ключ + " : " + Элемент.Значение);	
			КонецЦикла;
		КонецЕсли;
		
		Возврат СтруктураПараметры;	
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОсновнойОбъектПользователя(Пользователь = Неопределено) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОсновныеОбъектыДоступаПользователей.ОбъектДоступа КАК ОбъектДоступа
	|ИЗ
	|	РегистрСведений.ОсновныеОбъектыДоступаПользователей КАК ОсновныеОбъектыДоступаПользователей
	|ГДЕ
	|	ОсновныеОбъектыДоступаПользователей.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ?(Пользователь = Неопределено, Пользователи.ТекущийПользователь(), Пользователь));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.ОбъектДоступа;	
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьГруппыПользователя(Пользователь = Неопределено) Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ГруппыПользователейСостав.Ссылка КАК Группа
	|ИЗ
	|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|ГДЕ
	|	ГруппыПользователейСостав.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ?(Пользователь = Неопределено, Пользователи.ТекущийПользователь(), Пользователь));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Группа");
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТокенДоступа(client_id, client_secret)
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеАвторизацииДомКлик.access_token КАК access_token,
	|	ДанныеАвторизацииДомКлик.ГраницаДоступности КАК ГраницаДоступности
	|ИЗ
	|	РегистрСведений.ДанныеАвторизацииДомКлик КАК ДанныеАвторизацииДомКлик
	|ГДЕ
	|	ДанныеАвторизацииДомКлик.client_id = &client_id
	|	И ДанныеАвторизацииДомКлик.client_secret = &client_secret";
	
	Запрос.УстановитьПараметр("client_id", client_id);
	Запрос.УстановитьПараметр("client_secret", client_secret);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Если ВыборкаДетальныеЗаписи.ГраницаДоступности >= ТекущаяДата() Тогда
				Возврат ВыборкаДетальныеЗаписи.access_token;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

#Область Вспоимогательное

Функция СоздатьАнкету(АнкетаСсылка) Экспорт
	
	
	
КонецФункции	

Процедура ЗаполнитьПоДаннымАнкеты(ДанныеЗаполнения)
	
	КонтактноеЛицо = ДанныеЗаполнения.КонтактноеЛицо;
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
		
	СтруктураПараметров = ПолучитьКонтактныеДанныеКлиента(КонтактноеЛицо);
	
	ФИОКлиента = КонтактноеЛицо.ФИО;
	ДатаРожденияКлиента = КонтактноеЛицо.ДатаРождения;
	АдресФактическогоПроживания = СтруктураПараметров.АдресФактическогоПроживания;
	EmailКлиента = СтруктураПараметров.EmailКлиента;
	НомерТелефонаКлиента = СтруктураПараметров.НомерТелефона;
	СерияНомерПаспорта = СтруктураПараметров.СерияНомерПаспорта;
	
	ВопросыАнкетирования = Новый Массив;
	
	
	
	//"fullName"
	ВопросыАнкетирования = Новый Массив;
	
	ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000251")); //Имя:
	ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000251")); //Email:
	ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000249")); //Мобильный телефон
	
	ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000327")); //Серия паспорта
	ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000328")); //Номер паспорта
	ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000330")); //Кем выдан паспорт
	ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000329")); //Дата выдачи	
	ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000338")); //Код подразделения
	ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000486")); //Предыдущий паспорт

	ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000330")); //Кем выдан паспорт
	ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000329")); //Дата выдачи
	
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтветыНаВопросыАнкет.Ответ,
	|	ОтветыНаВопросыАнкет.ЭлементарныйВопрос,
	|	ОтветыНаВопросыАнкет.ЭлементарныйВопрос.Код КАК Код
	|ИЗ
	|	РегистрСведений.ОтветыНаВопросыАнкет КАК ОтветыНаВопросыАнкет
	|ГДЕ
	|	ОтветыНаВопросыАнкет.Регистратор = &Регистратор
	|	И ОтветыНаВопросыАнкет.ЭлементарныйВопрос В(&ЭлементарныйВопрос)";
	
	Запрос.УстановитьПараметр("Регистратор", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("ЭлементарныйВопрос", ВопросыАнкетирования);

	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		РезТЗ = РезультатЗапроса.Выгрузить();
		//Выборка = РезультатЗапроса.Выбрать();
		
		СерияНомерПаспорта = "" + СтрЗаменить(НайтиВТаблицеПоКоду(РезТЗ, "000000327"), " ", "") + " " + СтрЗаменить(НайтиВТаблицеПоКоду(РезТЗ, "000000328"), " ", "");
		ВидОбъектаНедвижимостиСтр = "" + НайтиВТаблицеПоКоду(РезТЗ, "000000221");
		НомерТелефонаКлиента = "" + НайтиВТаблицеПоКоду(РезТЗ, "000000249");
		EmailКлиента = "" + НайтиВТаблицеПоКоду(РезТЗ, "000000251");
		ФИОКлиента = "" + НайтиВТаблицеПоКоду(РезТЗ, "000000218") + " " + НайтиВТаблицеПоКоду(РезТЗ, "000000219") + " " + НайтиВТаблицеПоКоду(РезТЗ, "000000220");
		
		Если ВидОбъектаНедвижимостиСтр = "Строящееся жилье" Тогда
			ВидОбъектаНедвижимости = Справочники.ВидыОбъектовНедвижимости.Первичка;
		ИначеЕсли ВидОбъектаНедвижимостиСтр = "Готовое жилье" Тогда
			ВидОбъектаНедвижимости = Справочники.ВидыОбъектовНедвижимости.Вторичка;
		ИначеЕсли ВидОбъектаНедвижимостиСтр = "Загородная недвижимость" Тогда
			ВидОбъектаНедвижимости = Справочники.ВидыОбъектовНедвижимости.ЗагороднаяНедвижимость;
		Иначе
			ВидОбъектаНедвижимости = 0;				
		КонецЕсли;
		
		Попытка
			СуммаКредитаВРублях = НайтиВТаблицеПоКоду(РезТЗ, "000000224");
		Исключение
			СуммаКредитаВРублях = 0;	
		КонецПопытки;
		ПервоначальныйВзнос = НайтиВТаблицеПоКоду(РезТЗ, "000000225");
		Попытка
			ПредполагаемаяСтоимостьОН  = ?(СуммаКредитаВРублях = Неопределено, 0, СуммаКредитаВРублях) + ?(ПервоначальныйВзнос = Неопределено, 0, ПервоначальныйВзнос);
		Исключение
			ПредполагаемаяСтоимостьОН = 0;
		КонецПопытки;
		ДатаРожденияКлиента = НайтиВТаблицеПоКоду(РезТЗ, "000000315");
		АдресФактическогоПроживания = СобратьАдресФактическогоПроживания(РезТЗ);
		АдресМестаРаботы = СобратьАдресМестаРаботы(РезТЗ);
	КонецЕсли;
	
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000218")); //Фамилия
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000219")); //Имя
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000220")); //Отчество	
	//
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000221")); //Программа кредитования
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000224")); //Сумма кредита
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000225")); //Первоначальный взнос
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000315")); //Дата рождения
	//
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000239")); //Индекс ФП
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000238")); //Страна ФП
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000240")); //Регион ФП
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000241")); //Район ФП
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000242")); //Населенный пункт ФП
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000243")); //Улица ФП
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000244")); //Номер дома ФП
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000245")); //Корпус ФП
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000246")); //Строение ФП
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000247")); //Номер квартиры/офиса ФП
	//
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000277")); //Индекс ФО
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000276")); //Страна ФО
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000278")); //Регион ФО
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000279")); //Район ФО
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000280")); //Населенный пункт ФО
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000281")); //Улица ФО
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000284")); //Номер дома ФО
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000283")); //Корпус ФО
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000285")); //Строение ФО
	//ВопросыАнкетирования.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоКоду("000000282")); //Номер квартиры/офиса ФО
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ОтветыНаВопросыАнкет.Ответ,
	//|	ОтветыНаВопросыАнкет.ЭлементарныйВопрос,
	//|	ОтветыНаВопросыАнкет.ЭлементарныйВопрос.Код КАК Код
	//|ИЗ
	//|	РегистрСведений.ОтветыНаВопросыАнкет КАК ОтветыНаВопросыАнкет
	//|ГДЕ
	//|	ОтветыНаВопросыАнкет.Регистратор = &Регистратор
	//|	И ОтветыНаВопросыАнкет.ЭлементарныйВопрос В(&ЭлементарныйВопрос)";
	//
	//Запрос.УстановитьПараметр("Регистратор", ДанныеЗаполнения);
	//Запрос.УстановитьПараметр("ЭлементарныйВопрос", ВопросыАнкетирования);

	//РезультатЗапроса = Запрос.Выполнить();
	//Если НЕ РезультатЗапроса.Пустой() Тогда
	//	РезТЗ = РезультатЗапроса.Выгрузить();
	//	//Выборка = РезультатЗапроса.Выбрать();
	//	СерияНомерПаспорта = "" + СтрЗаменить(НайтиВТаблицеПоКоду(РезТЗ, "000000327"), " ", "") + " " + СтрЗаменить(НайтиВТаблицеПоКоду(РезТЗ, "000000328"), " ", "");
	//	ВидОбъектаНедвижимостиСтр = "" + НайтиВТаблицеПоКоду(РезТЗ, "000000221");
	//	НомерТелефонаКлиента = "" + НайтиВТаблицеПоКоду(РезТЗ, "000000249");
	//	EmailКлиента = "" + НайтиВТаблицеПоКоду(РезТЗ, "000000251");
	//	ФИОКлиента = "" + НайтиВТаблицеПоКоду(РезТЗ, "000000218") + " " + НайтиВТаблицеПоКоду(РезТЗ, "000000219") + " " + НайтиВТаблицеПоКоду(РезТЗ, "000000220");
	//	
	//	Если ВидОбъектаНедвижимостиСтр = "Строящееся жилье" Тогда
	//		ВидОбъектаНедвижимости = Справочники.ВидыОбъектовНедвижимости.Первичка;
	//	ИначеЕсли ВидОбъектаНедвижимостиСтр = "Готовое жилье" Тогда
	//		ВидОбъектаНедвижимости = Справочники.ВидыОбъектовНедвижимости.Вторичка;
	//	ИначеЕсли ВидОбъектаНедвижимостиСтр = "Загородная недвижимость" Тогда
	//		ВидОбъектаНедвижимости = Справочники.ВидыОбъектовНедвижимости.ЗагороднаяНедвижимость;
	//	Иначе
	//		ВидОбъектаНедвижимости = 0;				
	//	КонецЕсли;
	//	
	//	Попытка
	//		СуммаКредитаВРублях = НайтиВТаблицеПоКоду(РезТЗ, "000000224");
	//	Исключение
	//		СуммаКредитаВРублях = 0;	
	//	КонецПопытки;
	//	ПервоначальныйВзнос = НайтиВТаблицеПоКоду(РезТЗ, "000000225");
	//	Попытка
	//		ПредполагаемаяСтоимостьОН  = ?(СуммаКредитаВРублях = Неопределено, 0, СуммаКредитаВРублях) + ?(ПервоначальныйВзнос = Неопределено, 0, ПервоначальныйВзнос);
	//	Исключение
	//		ПредполагаемаяСтоимостьОН = 0;
	//	КонецПопытки;
	//	ДатаРожденияКлиента = НайтиВТаблицеПоКоду(РезТЗ, "000000315");
	//	АдресФактическогоПроживания = СобратьАдресФактическогоПроживания(РезТЗ);
	//	АдресМестаРаботы = СобратьАдресМестаРаботы(РезТЗ);
	//КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьКонтактныеДанныеКлиента(Клиент)
	
	СтруктураПараметров = Новый Структура("АдресФактическогоПроживания, СерияНомерПаспорта, НомерТелефона, EmailКлиента");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлиентыКонтактнаяИнформация.Представление КАК Представление,
		|	"""" КАК Серия,
		|	"""" КАК Номер,
		|	1 КАК Ключ
		|ИЗ
		|	Справочник.Клиенты.КонтактнаяИнформация КАК КлиентыКонтактнаяИнформация
		|ГДЕ
		|	КлиентыКонтактнаяИнформация.Ссылка = &ФизЛицо
		|	И КлиентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|	И КлиентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияКлиента)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	"""",
		|	ДокументыФизическихЛицСрезПоследних.Серия,
		|	ДокументыФизическихЛицСрезПоследних.Номер,
		|	2
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
		|			&Период,
		|			ФизЛицо = &ФизЛицо
		|				И ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)) КАК ДокументыФизическихЛицСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КлиентыКонтактнаяИнформация.Представление,
		|	"""",
		|	"""",
		|	3
		|ИЗ
		|	Справочник.Клиенты.КонтактнаяИнформация КАК КлиентыКонтактнаяИнформация
		|ГДЕ
		|	КлиентыКонтактнаяИнформация.Ссылка = &ФизЛицо
		|	И КлиентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|	И КлиентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ОсновнойТелефонКлиента)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КлиентыКонтактнаяИнформация.Представление,
		|	"""",
		|	"""",
		|	4
		|ИЗ
		|	Справочник.Клиенты.КонтактнаяИнформация КАК КлиентыКонтактнаяИнформация
		|ГДЕ
		|	КлиентыКонтактнаяИнформация.Ссылка = &ФизЛицо
		|	И КлиентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		|	И КлиентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКлиента)";
	
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("ФизЛицо", Клиент);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		СтруктураПараметров.АдресФактическогоПроживания = "";
	Иначе
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.Ключ = 1 Тогда
				СтруктураПараметров.АдресФактическогоПроживания = Выборка.Представление;
			ИначеЕсли Выборка.Ключ = 2 Тогда
				СтруктураПараметров.СерияНомерПаспорта = СтрЗаменить(Выборка.Серия, " ", "") + " " + СтрЗаменить(Выборка.Номер, " ", "");
			ИначеЕсли Выборка.Ключ = 3 Тогда
				СтруктураПараметров.НомерТелефона = Выборка.Представление;
			ИначеЕсли Выборка.Ключ = 4 Тогда
				СтруктураПараметров.EmailКлиента = Выборка.Представление;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции

Функция СобратьАдресФактическогоПроживания(РезТЗ)
	
	Индекс = СокрЛП(НайтиВТаблицеПоКоду(РезТЗ, "000000239"));
	Страна = СокрЛП(НайтиВТаблицеПоКоду(РезТЗ, "000000238"));
	Регион = СокрЛП(НайтиВТаблицеПоКоду(РезТЗ, "000000240"));
	Район = СокрЛП(НайтиВТаблицеПоКоду(РезТЗ, "000000241"));
	НаселенныйПункт = СокрЛП(НайтиВТаблицеПоКоду(РезТЗ, "000000242"));
	Улица = СокрЛП(НайтиВТаблицеПоКоду(РезТЗ, "000000243"));
	НомерДома = СокрЛП(НайтиВТаблицеПоКоду(РезТЗ, "000000244"));
	Корпус = СокрЛП(НайтиВТаблицеПоКоду(РезТЗ, "000000245"));
	Строение = СокрЛП(НайтиВТаблицеПоКоду(РезТЗ, "000000246"));
	Номер = СокрЛП(НайтиВТаблицеПоКоду(РезТЗ, "000000247"));
	
	АдресФактическогоПроживания = ?(ЗначениеЗаполнено(Индекс), Индекс + ", ", "")
		+ ?(ЗначениеЗаполнено(Страна), Страна + ", ", "")
		+ ?(ЗначениеЗаполнено(Район), Район + ", ", "")
		+ ?(ЗначениеЗаполнено(НаселенныйПункт), НаселенныйПункт + ", ", "")
		+ ?(ЗначениеЗаполнено(Улица), Улица + ", ", "")
		+ ?(ЗначениеЗаполнено(НомерДома), НомерДома + ", ", "")
		+ ?(ЗначениеЗаполнено(Корпус), Корпус + ", ", "")
		+ ?(ЗначениеЗаполнено(Строение), Строение + ", ", "")
		+ ?(ЗначениеЗаполнено(Номер), Номер + ", ", "");
	
	Возврат ?(ЗначениеЗаполнено(АдресФактическогоПроживания), Сред(АдресФактическогоПроживания, 1, СтрДлина(АдресФактическогоПроживания) - 2), "");	
	
КонецФункции

Функция СобратьАдресМестаРаботы(РезТЗ)
	
	Индекс = СокрЛП(НайтиВТаблицеПоКоду(РезТЗ, "000000277"));
	Страна = СокрЛП(НайтиВТаблицеПоКоду(РезТЗ, "000000276"));
	Регион = СокрЛП(НайтиВТаблицеПоКоду(РезТЗ, "000000278"));
	Район = СокрЛП(НайтиВТаблицеПоКоду(РезТЗ, "000000279"));
	НаселенныйПункт = СокрЛП(НайтиВТаблицеПоКоду(РезТЗ, "000000280"));
	Улица = СокрЛП(НайтиВТаблицеПоКоду(РезТЗ, "000000281"));
	НомерДома = СокрЛП(НайтиВТаблицеПоКоду(РезТЗ, "000000284"));
	Корпус = СокрЛП(НайтиВТаблицеПоКоду(РезТЗ, "000000283"));
	Строение = СокрЛП(НайтиВТаблицеПоКоду(РезТЗ, "000000285"));
	Номер = СокрЛП(НайтиВТаблицеПоКоду(РезТЗ, "000000282"));
	
	АдресМестаРаботы = ?(ЗначениеЗаполнено(Индекс), Индекс + ", ", "")
		+ ?(ЗначениеЗаполнено(Страна), Страна + ", ", "")
		+ ?(ЗначениеЗаполнено(Район), Район + ", ", "")
		+ ?(ЗначениеЗаполнено(НаселенныйПункт), НаселенныйПункт + ", ", "")
		+ ?(ЗначениеЗаполнено(Улица), Улица + ", ", "")
		+ ?(ЗначениеЗаполнено(НомерДома), НомерДома + ", ", "")
		+ ?(ЗначениеЗаполнено(Корпус), Корпус + ", ", "")
		+ ?(ЗначениеЗаполнено(Строение), Строение + ", ", "")
		+ ?(ЗначениеЗаполнено(Номер), Номер + ", ", "");
	
	Возврат ?(ЗначениеЗаполнено(АдресМестаРаботы), Сред(АдресМестаРаботы, 1, СтрДлина(АдресМестаРаботы) - 2), "");	
	
КонецФункции

Функция НайтиВТаблицеПоКоду(ТЗ, Код)
	
	Ответ = Неопределено;
	НайденныеСтроки = ТЗ.НайтиСтроки(Новый Структура("Код", Код));
	Если НайденныеСтроки.Количество() Тогда	
		Ответ = НайденныеСтроки[0].Ответ;
		Если ТипЗнч(Ответ) = Тип("СправочникСсылка.ВариантыОтветовАнкет") Тогда
			Ответ = СокрЛП(Ответ);
		//ИначеЕсли ТипЗнч(Ответ) = Тип("Дата") Тогда
		//	Ответ = Формат(Ответ, "ДФ=yyyy-MM-dd");
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти
